In [1]:
# importing libraries
import pandas as pd

In [11]:
# dataframes
df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["A", "B", "C"]
})

df2 = pd.DataFrame({
    "id": [2, 3, 4],
    "salary": [50000, 60000, 70000]
})

MERGING DATAFRAMES

In [3]:
# inner merge (keeps only common rows)
pd.merge(df1, df2, on="id", how="inner")

   id name  salary
0   2    B   50000
1   3    C   60000

In [4]:
# left merge (all rows from left dataframe)
pd.merge(df1, df2, on="id", how="left")

   id name   salary
0   1    A      NaN
1   2    B  50000.0
2   3    C  60000.0

In [5]:
# right merge (all rows from right dataframe)
pd.merge(df1, df2, on="id", how="right")

   id name  salary
0   2    B   50000
1   3    C   60000
2   4  NaN   70000

In [6]:
# outer merge (all rows from both tables)
pd.merge(df1, df2, on="id", how="outer")

   id name   salary
0   1    A      NaN
1   2    B  50000.0
2   3    C  60000.0
3   4  NaN  70000.0

In [10]:
# merging with different column names
df3 = pd.DataFrame({
    "user_id": [2, 3, 4],
    "salary": [50000, 60000, 70000]
})

pd.merge(df1, df3, left_on="id", right_on="user_id", how="outer")

    id name  user_id   salary
0  1.0    A      NaN      NaN
1  2.0    B      2.0  50000.0
2  3.0    C      3.0  60000.0
3  NaN  NaN      4.0  70000.0

CONCATENATING DATAFRAMES

In [12]:
# row=wise concatenation
pd.concat([df1, df2])

   id name   salary
0   1    A      NaN
1   2    B      NaN
2   3    C      NaN
0   2  NaN  50000.0
1   3  NaN  60000.0
2   4  NaN  70000.0

In [13]:
# row-wise concatenation after index reset
pd.concat([df1, df2], ignore_index=True)

   id name   salary
0   1    A      NaN
1   2    B      NaN
2   3    C      NaN
3   2  NaN  50000.0
4   3  NaN  60000.0
5   4  NaN  70000.0

In [16]:
# column-wise concatenation
pd.concat([df1,df2], axis=1)

   id name  id  salary
0   1    A   2   50000
1   2    B   3   60000
2   3    C   4   70000

JOINING DATAFRAMES

In [17]:
df1_indexed = df1.set_index("id")
df2_indexed = df2.set_index("id")
df1_indexed.join(df2_indexed)

   name   salary
id
1     A      NaN
2     B  50000.0
3     C  60000.0

In [18]:
df1_indexed.join(df2_indexed, how = "outer")

   name   salary
id
1     A      NaN
2     B  50000.0
3     C  60000.0
4   NaN  70000.0

In [19]:
df1.join(df2.set_index("id"), on="id")

   id name   salary
0   1    A      NaN
1   2    B  50000.0
2   3    C  60000.0